In [1]:
import pandas as pd
houses = pd.read_csv("data/kc_house_data.csv")
titanic = pd.read_csv("data/titanic.csv")
nf = pd.read_csv("data/netflix_titles.csv", sep = "|", index_col = 0)
btc =  pd.read_csv("data/coin_Bitcoin.csv")
countries = pd.read_csv("data/world-happiness-report-2021.csv")
countries.set_index("Country name", inplace=  True)

In [3]:
##Usng the astype method to convert an object dtype to int

titanic.age.astype("float") ## this doesnt work beccayse we have "?" in many places so we have to replave that first

ValueError: could not convert string to float: '?'

In [8]:
## So we convert ? to None value and then apply the casting

titanic.age.replace("?", None, inplace = True)
titanic.age.tail(10)

1299      27
1300      15
1301    45.5
1302    None
1303    None
1304    14.5
1305    None
1306    26.5
1307      27
1308      29
Name: age, dtype: object

In [9]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   object
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1309 non-null   object
 9   cabin      1309 non-null   object
 10  embarked   1309 non-null   object
 11  boat       1309 non-null   object
 12  body       1309 non-null   object
 13  home.dest  1309 non-null   object
dtypes: int64(4), object(10)
memory usage: 143.3+ KB

In [16]:
titanic.age.astype("float") ## this will not change the column inplace

titanic["age_float"] = titanic.age.astype("float") ## this will add a new column (or we could have updated the original column)
titanic.head(2)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,age_float
0,1,1,"Allen, Miss. Elisabeth Walton",female,29,0,0,24160,211.3375,B5,S,2,?,"St Louis, MO",29.0000
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.55,C22 C26,S,11,?,"Montreal, PQ / Chesterville, ON",0.9167

In [17]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 15 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   object
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1309 non-null   object
 9   cabin      1309 non-null   object
 10  embarked   1309 non-null   object
 11  boat       1309 non-null   object
 12  body       1309 non-null   object
 13  home.dest  1309 non-null   object
 14  age_float  1046 non-null   float64
dtypes: float64(1), int64(4), object(10)
memory usage: 153.5+ KB

<h3> Introducing the category type </h3>


**Category datatype would mean the variable can take only a finit no of values such as M or F**

Where this would help is if we have a column with Object values it can take any value so it will set aside or use much more space vs category

In the above case before casting sex as category dtype we had 154kb of memory usage, after it should reduce

In [18]:
titanic["sex"] = titanic.sex.astype("category")
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 15 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   category
 4   age        1046 non-null   object
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1309 non-null   object
 9   cabin      1309 non-null   object
 10  embarked   1309 non-null   object
 11  boat       1309 non-null   object
 12  body       1309 non-null   object
 13  home.dest  1309 non-null   object
 14  age_float  1046 non-null   float64
dtypes: category(1), float64(1), int64(4), object(9)
memory usage: 144.7+ KB

**as you see the memory usage has reduced to 144.7kb**

This is because if we use object dtype, even though we are using same two values, but memory has to be allotted for each item, however if it is category memory has to be allotted for only 2 items and each row just stores the reference to the memory of the two elements

In [19]:
titanic["sex"] = "MALE" ##If I run this it will go back to being an object

In [20]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 15 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   object
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1309 non-null   object
 9   cabin      1309 non-null   object
 10  embarked   1309 non-null   object
 11  boat       1309 non-null   object
 12  body       1309 non-null   object
 13  home.dest  1309 non-null   object
 14  age_float  1046 non-null   float64
dtypes: float64(1), int64(4), object(10)
memory usage: 153.5+ KB

<h3> Casting with pd.to_numeric </h3>

In [21]:
##to_numeric is a pd method and not a series method, but takes series as an input

In [22]:
titanic = pd.read_csv("data/titanic.csv")

In [25]:
titanic["age"] = pd.to_numeric(titanic["age"], errors = "coerce") ## we need to put in coerce so that if thre is an error it converts to NaN

In [26]:
titanic.age.describe()

count    1046.000000
mean       29.881135
std        14.413500
min         0.166700
25%        21.000000
50%        28.000000
75%        39.000000
max        80.000000
Name: age, dtype: float64

<h3> dropna and isna method </h3>

In [27]:
stats = pd.read_csv("data/game_stats.csv")

In [28]:
stats.head(1)

  name league  points  assists  rebounds
0  bob    nba    22.0      5.0      10.0

In [29]:
stats.assists.mean()

6.5

In [32]:
stats.isna() ## this will return entire Df and wehther the value of any element is na or not na

    name  league  points  assists  rebounds
0  False   False   False    False     False
1  False    True   False     True     False
2  False   False    True     True      True
3  False   False   False     True     False
4  False    True   False     True      True
5  False   False   False    False     False
6   True    True    True     True      True

In [33]:
## can also do it on a series
stats.assists.isna()

0    False
1     True
2     True
3     True
4     True
5    False
6     True
Name: assists, dtype: bool

<h3> dropna</h3>

In [36]:
##dropna will give an updated series dropping the values of Na

stats["assists"].dropna()

0    5.0
5    8.0
Name: assists, dtype: float64

In [38]:
stats.dropna() ##for df - it will drop any row which have even a single NaN value is there

    name league  points  assists  rebounds
0    bob    nba    22.0      5.0      10.0
5  steph    nba    49.0      8.0      10.0

In [39]:
stats.dropna(how = "all") ## this will drop only those rows where all values are Na

       name      league  points  assists  rebounds
0       bob         nba    22.0      5.0      10.0
1    jessie         NaN    10.0      NaN       2.0
2       stu  euroleague     NaN      NaN       NaN
3   jackson         aba     9.0      NaN       2.0
4  timothee         NaN     8.0      NaN       NaN
5     steph         nba    49.0      8.0      10.0

In [40]:
## focus only on a particular column/s with Na values

stats.dropna(subset= "league") ## this will drop Na values for any rows where league is Na

      name      league  points  assists  rebounds
0      bob         nba    22.0      5.0      10.0
2      stu  euroleague     NaN      NaN       NaN
3  jackson         aba     9.0      NaN       2.0
5    steph         nba    49.0      8.0      10.0

In [41]:
stats.dropna(axis = 1) ## this will drop any column which has any Na value

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6]

In [42]:
stats

       name      league  points  assists  rebounds
0       bob         nba    22.0      5.0      10.0
1    jessie         NaN    10.0      NaN       2.0
2       stu  euroleague     NaN      NaN       NaN
3   jackson         aba     9.0      NaN       2.0
4  timothee         NaN     8.0      NaN       NaN
5     steph         nba    49.0      8.0      10.0
6       NaN         NaN     NaN      NaN       NaN

<h3> fillna function </h3>

Teplace or update Na values

In [43]:
stats.fillna(0) ## will replace all values Na with 0

       name      league  points  assists  rebounds
0       bob         nba    22.0      5.0      10.0
1    jessie           0    10.0      0.0       2.0
2       stu  euroleague     0.0      0.0       0.0
3   jackson         aba     9.0      0.0       2.0
4  timothee           0     8.0      0.0       0.0
5     steph         nba    49.0      8.0      10.0
6         0           0     0.0      0.0       0.0

In [46]:

stats["league"].fillna("amateur") ## this is no inplace

0           nba
1       amateur
2    euroleague
3           aba
4       amateur
5           nba
6       amateur
Name: league, dtype: object

In [47]:
##can update columns in one go with different values replacing Na

stats.fillna({"points": 0, "assists": "NONE"})

       name      league  points assists  rebounds
0       bob         nba    22.0     5.0      10.0
1    jessie         NaN    10.0    NONE       2.0
2       stu  euroleague     0.0    NONE       NaN
3   jackson         aba     9.0    NONE       2.0
4  timothee         NaN     8.0    NONE       NaN
5     steph         nba    49.0     8.0      10.0
6       NaN         NaN     0.0    NONE       NaN

In [48]:
sales = pd.read_csv("data/sales.csv")

In [49]:
sales

   rating  shipping_zip  billing_zip
0     5.0           NaN      81220.0
1     4.5       94931.0      94931.0
2     NaN       92625.0      92625.0
3     4.5       10003.0      10003.0
4     4.0           NaN      92660.0
5     NaN           NaN          NaN
6     NaN       60007.0      60007.0

In [52]:
## we can replace the missing values in shipping zip with billing zip

sales["shipping_zip"].fillna(sales["billing_zip"])

0    81220.0
1    94931.0
2    92625.0
3    10003.0
4    92660.0
5        NaN
6    60007.0
Name: shipping_zip, dtype: float64